RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/can_reg.h
/**
  ******************************************************************************
  * @file    can_reg.h
  * @version V1.0
  * @date    2020-12-29
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __CAN_REG_H__
#define __CAN_REG_H__

#include "bl808.h"

/* 0x0 : op mode:rw        reset mode:rw */
#define CAN_MODE_OFFSET            (0x0)
#define CAN_RESET_REQUEST          CAN_RESET_REQUEST
#define CAN_RESET_REQUEST_POS      (0U)
#define CAN_RESET_REQUEST_LEN      (1U)
#define CAN_RESET_REQUEST_MSK      (((1U << CAN_RESET_REQUEST_LEN) - 1) << CAN_RESET_REQUEST_POS)
#define CAN_RESET_REQUEST_UMSK     (~(((1U << CAN_RESET_REQUEST_LEN) - 1) << CAN_RESET_REQUEST_POS))
#define CAN_LISTEN_ONLY            CAN_LISTEN_ONLY
#define CAN_LISTEN_ONLY_POS        (1U)
#define CAN_LISTEN_ONLY_LEN        (1U)
#define CAN_LISTEN_ONLY_MSK        (((1U << CAN_LISTEN_ONLY_LEN) - 1) << CAN_LISTEN_ONLY_POS)
#define CAN_LISTEN_ONLY_UMSK       (~(((1U << CAN_LISTEN_ONLY_LEN) - 1) << CAN_LISTEN_ONLY_POS))
#define CAN_SELT_TEST              CAN_SELT_TEST
#define CAN_SELT_TEST_POS          (2U)
#define CAN_SELT_TEST_LEN          (1U)
#define CAN_SELT_TEST_MSK          (((1U << CAN_SELT_TEST_LEN) - 1) << CAN_SELT_TEST_POS)
#define CAN_SELT_TEST_UMSK         (~(((1U << CAN_SELT_TEST_LEN) - 1) << CAN_SELT_TEST_POS))
#define CAN_ACCEPTANCE_FILTER      CAN_ACCEPTANCE_FILTER
#define CAN_ACCEPTANCE_FILTER_POS  (3U)
#define CAN_ACCEPTANCE_FILTER_LEN  (1U)
#define CAN_ACCEPTANCE_FILTER_MSK  (((1U << CAN_ACCEPTANCE_FILTER_LEN) - 1) << CAN_ACCEPTANCE_FILTER_POS)
#define CAN_ACCEPTANCE_FILTER_UMSK (~(((1U << CAN_ACCEPTANCE_FILTER_LEN) - 1) << CAN_ACCEPTANCE_FILTER_POS))

/* 0x4 : op mode:w        r  ->  8'h00
reset mode:w    r   -> 8'h00 */
#define CAN_COMMAND_OFFSET              (0x4)
#define CAN_TRANSMIT_REQUEST            CAN_TRANSMIT_REQUEST
#define CAN_TRANSMIT_REQUEST_POS        (0U)
#define CAN_TRANSMIT_REQUEST_LEN        (1U)
#define CAN_TRANSMIT_REQUEST_MSK        (((1U << CAN_TRANSMIT_REQUEST_LEN) - 1) << CAN_TRANSMIT_REQUEST_POS)
#define CAN_TRANSMIT_REQUEST_UMSK       (~(((1U << CAN_TRANSMIT_REQUEST_LEN) - 1) << CAN_TRANSMIT_REQUEST_POS))
#define CAN_ABORT_TRANSMISSION          CAN_ABORT_TRANSMISSION
#define CAN_ABORT_TRANSMISSION_POS      (1U)
#define CAN_ABORT_TRANSMISSION_LEN      (1U)
#define CAN_ABORT_TRANSMISSION_MSK      (((1U << CAN_ABORT_TRANSMISSION_LEN) - 1) << CAN_ABORT_TRANSMISSION_POS)
#define CAN_ABORT_TRANSMISSION_UMSK     (~(((1U << CAN_ABORT_TRANSMISSION_LEN) - 1) << CAN_ABORT_TRANSMISSION_POS))
#define CAN_RELEASE_RECEIVE_BUFFER      CAN_RELEASE_RECEIVE_BUFFER
#define CAN_RELEASE_RECEIVE_BUFFER_POS  (2U)
#define CAN_RELEASE_RECEIVE_BUFFER_LEN  (1U)
#define CAN_RELEASE_RECEIVE_BUFFER_MSK  (((1U << CAN_RELEASE_RECEIVE_BUFFER_LEN) - 1) << CAN_RELEASE_RECEIVE_BUFFER_POS)
#define CAN_RELEASE_RECEIVE_BUFFER_UMSK (~(((1U << CAN_RELEASE_RECEIVE_BUFFER_LEN) - 1) << CAN_RELEASE_RECEIVE_BUFFER_POS))
#define CAN_CLEAR_DATA_OVERRUN          CAN_CLEAR_DATA_OVERRUN
#define CAN_CLEAR_DATA_OVERRUN_POS      (3U)
#define CAN_CLEAR_DATA_OVERRUN_LEN      (1U)
#define CAN_CLEAR_DATA_OVERRUN_MSK      (((1U << CAN_CLEAR_DATA_OVERRUN_LEN) - 1) << CAN_CLEAR_DATA_OVERRUN_POS)
#define CAN_CLEAR_DATA_OVERRUN_UMSK     (~(((1U << CAN_CLEAR_DATA_OVERRUN_LEN) - 1) << CAN_CLEAR_DATA_OVERRUN_POS))
#define CAN_SELF_REQUEST                CAN_SELF_REQUEST
#define CAN_SELF_REQUEST_POS            (4U)
#define CAN_SELF_REQUEST_LEN            (1U)
#define CAN_SELF_REQUEST_MSK            (((1U << CAN_SELF_REQUEST_LEN) - 1) << CAN_SELF_REQUEST_POS)
#define CAN_SELF_REQUEST_UMSK           (~(((1U << CAN_SELF_REQUEST_LEN) - 1) << CAN_SELF_REQUEST_POS))

/* 0x8 : op mode:r       reset mode:r */
#define CAN_STATUS_OFFSET              (0x8)
#define CAN_RECEIVE_BUFFER_STS         CAN_RECEIVE_BUFFER_STS
#define CAN_RECEIVE_BUFFER_STS_POS     (0U)
#define CAN_RECEIVE_BUFFER_STS_LEN     (1U)
#define CAN_RECEIVE_BUFFER_STS_MSK     (((1U << CAN_RECEIVE_BUFFER_STS_LEN) - 1) << CAN_RECEIVE_BUFFER_STS_POS)
#define CAN_RECEIVE_BUFFER_STS_UMSK    (~(((1U << CAN_RECEIVE_BUFFER_STS_LEN) - 1) << CAN_RECEIVE_BUFFER_STS_POS))
#define CAN_DATA_OVERRUN_STS           CAN_DATA_OVERRUN_STS
#define CAN_DATA_OVERRUN_STS_POS       (1U)
#define CAN_DATA_OVERRUN_STS_LEN       (1U)
#define CAN_DATA_OVERRUN_STS_MSK       (((1U << CAN_DATA_OVERRUN_STS_LEN) - 1) << CAN_DATA_OVERRUN_STS_POS)
#define CAN_DATA_OVERRUN_STS_UMSK      (~(((1U << CAN_DATA_OVERRUN_STS_LEN) - 1) << CAN_DATA_OVERRUN_STS_POS))
#define CAN_TRANSMIT_BUFFER_STS        CAN_TRANSMIT_BUFFER_STS
#define CAN_TRANSMIT_BUFFER_STS_POS    (2U)
#define CAN_TRANSMIT_BUFFER_STS_LEN    (1U)
#define CAN_TRANSMIT_BUFFER_STS_MSK    (((1U << CAN_TRANSMIT_BUFFER_STS_LEN) - 1) << CAN_TRANSMIT_BUFFER_STS_POS)
#define CAN_TRANSMIT_BUFFER_STS_UMSK   (~(((1U << CAN_TRANSMIT_BUFFER_STS_LEN) - 1) << CAN_TRANSMIT_BUFFER_STS_POS))
#define CAN_TRANSMIT_COMPLETE_STS      CAN_TRANSMIT_COMPLETE_STS
#define CAN_TRANSMIT_COMPLETE_STS_POS  (3U)
#define CAN_TRANSMIT_COMPLETE_STS_LEN  (1U)
#define CAN_TRANSMIT_COMPLETE_STS_MSK  (((1U << CAN_TRANSMIT_COMPLETE_STS_LEN) - 1) << CAN_TRANSMIT_COMPLETE_STS_POS)
#define CAN_TRANSMIT_COMPLETE_STS_UMSK (~(((1U << CAN_TRANSMIT_COMPLETE_STS_LEN) - 1) << CAN_TRANSMIT_COMPLETE_STS_POS))
#define CAN_RECEIVE_STS                CAN_RECEIVE_STS
#define CAN_RECEIVE_STS_POS            (4U)
#define CAN_RECEIVE_STS_LEN            (1U)
#define CAN_RECEIVE_STS_MSK            (((1U << CAN_RECEIVE_STS_LEN) - 1) << CAN_RECEIVE_STS_POS)
#define CAN_RECEIVE_STS_UMSK           (~(((1U << CAN_RECEIVE_STS_LEN) - 1) << CAN_RECEIVE_STS_POS))
#define CAN_TRANSMIT_STS               CAN_TRANSMIT_STS
#define CAN_TRANSMIT_STS_POS           (5U)
#define CAN_TRANSMIT_STS_LEN           (1U)
#define CAN_TRANSMIT_STS_MSK           (((1U << CAN_TRANSMIT_STS_LEN) - 1) << CAN_TRANSMIT_STS_POS)
#define CAN_TRANSMIT_STS_UMSK          (~(((1U << CAN_TRANSMIT_STS_LEN) - 1) << CAN_TRANSMIT_STS_POS))
#define CAN_ERROR_STS                  CAN_ERROR_STS
#define CAN_ERROR_STS_POS              (6U)
#define CAN_ERROR_STS_LEN              (1U)
#define CAN_ERROR_STS_MSK              (((1U << CAN_ERROR_STS_LEN) - 1) << CAN_ERROR_STS_POS)
#define CAN_ERROR_STS_UMSK             (~(((1U << CAN_ERROR_STS_LEN) - 1) << CAN_ERROR_STS_POS))
#define CAN_BUS_STS                    CAN_BUS_STS
#define CAN_BUS_STS_POS                (7U)
#define CAN_BUS_STS_LEN                (1U)
#define CAN_BUS_STS_MSK                (((1U << CAN_BUS_STS_LEN) - 1) << CAN_BUS_STS_POS)
#define CAN_BUS_STS_UMSK               (~(((1U << CAN_BUS_STS_LEN) - 1) << CAN_BUS_STS_POS))

/* 0xc : op mode:r        reset mode:r      when be read,all bits are reseted and can_int disappear */
#define CAN_INTERRUPT_OFFSET       (0xc)
#define CAN_RECEIVE_INT            CAN_RECEIVE_INT
#define CAN_RECEIVE_INT_POS        (0U)
#define CAN_RECEIVE_INT_LEN        (1U)
#define CAN_RECEIVE_INT_MSK        (((1U << CAN_RECEIVE_INT_LEN) - 1) << CAN_RECEIVE_INT_POS)
#define CAN_RECEIVE_INT_UMSK       (~(((1U << CAN_RECEIVE_INT_LEN) - 1) << CAN_RECEIVE_INT_POS))
#define CAN_TRANSMIT_INT           CAN_TRANSMIT_INT
#define CAN_TRANSMIT_INT_POS       (1U)
#define CAN_TRANSMIT_INT_LEN       (1U)
#define CAN_TRANSMIT_INT_MSK       (((1U << CAN_TRANSMIT_INT_LEN) - 1) << CAN_TRANSMIT_INT_POS)
#define CAN_TRANSMIT_INT_UMSK      (~(((1U << CAN_TRANSMIT_INT_LEN) - 1) << CAN_TRANSMIT_INT_POS))
#define CAN_ERROR_INT              CAN_ERROR_INT
#define CAN_ERROR_INT_POS          (2U)
#define CAN_ERROR_INT_LEN          (1U)
#define CAN_ERROR_INT_MSK          (((1U << CAN_ERROR_INT_LEN) - 1) << CAN_ERROR_INT_POS)
#define CAN_ERROR_INT_UMSK         (~(((1U << CAN_ERROR_INT_LEN) - 1) << CAN_ERROR_INT_POS))
#define CAN_DATA_OVERRUN_INT       CAN_DATA_OVERRUN_INT
#define CAN_DATA_OVERRUN_INT_POS   (3U)
#define CAN_DATA_OVERRUN_INT_LEN   (1U)
#define CAN_DATA_OVERRUN_INT_MSK   (((1U << CAN_DATA_OVERRUN_INT_LEN) - 1) << CAN_DATA_OVERRUN_INT_POS)
#define CAN_DATA_OVERRUN_INT_UMSK  (~(((1U << CAN_DATA_OVERRUN_INT_LEN) - 1) << CAN_DATA_OVERRUN_INT_POS))
#define CAN_ERROR_PASSIVE_INT      CAN_ERROR_PASSIVE_INT
#define CAN_ERROR_PASSIVE_INT_POS  (5U)
#define CAN_ERROR_PASSIVE_INT_LEN  (1U)
#define CAN_ERROR_PASSIVE_INT_MSK  (((1U << CAN_ERROR_PASSIVE_INT_LEN) - 1) << CAN_ERROR_PASSIVE_INT_POS)
#define CAN_ERROR_PASSIVE_INT_UMSK (~(((1U << CAN_ERROR_PASSIVE_INT_LEN) - 1) << CAN_ERROR_PASSIVE_INT_POS))
#define CAN_ARB_LOST_INT           CAN_ARB_LOST_INT
#define CAN_ARB_LOST_INT_POS       (6U)
#define CAN_ARB_LOST_INT_LEN       (1U)
#define CAN_ARB_LOST_INT_MSK       (((1U << CAN_ARB_LOST_INT_LEN) - 1) << CAN_ARB_LOST_INT_POS)
#define CAN_ARB_LOST_INT_UMSK      (~(((1U << CAN_ARB_LOST_INT_LEN) - 1) << CAN_ARB_LOST_INT_POS))
#define CAN_BUS_ERROR_INT          CAN_BUS_ERROR_INT
#define CAN_BUS_ERROR_INT_POS      (7U)
#define CAN_BUS_ERROR_INT_LEN      (1U)
#define CAN_BUS_ERROR_INT_MSK      (((1U << CAN_BUS_ERROR_INT_LEN) - 1) << CAN_BUS_ERROR_INT_POS)
#define CAN_BUS_ERROR_INT_UMSK     (~(((1U << CAN_BUS_ERROR_INT_LEN) - 1) << CAN_BUS_ERROR_INT_POS))

/* 0x10 : op mode:rw        reset mode:rw      when be read,all bits are reseted and can_int disappear */
#define CAN_INTERRUPT_ENABLE_OFFSET   (0x10)
#define CAN_RECEIVE_INT_EN            CAN_RECEIVE_INT_EN
#define CAN_RECEIVE_INT_EN_POS        (0U)
#define CAN_RECEIVE_INT_EN_LEN        (1U)
#define CAN_RECEIVE_INT_EN_MSK        (((1U << CAN_RECEIVE_INT_EN_LEN) - 1) << CAN_RECEIVE_INT_EN_POS)
#define CAN_RECEIVE_INT_EN_UMSK       (~(((1U << CAN_RECEIVE_INT_EN_LEN) - 1) << CAN_RECEIVE_INT_EN_POS))
#define CAN_TRANSMIT_INT_EN           CAN_TRANSMIT_INT_EN
#define CAN_TRANSMIT_INT_EN_POS       (1U)
#define CAN_TRANSMIT_INT_EN_LEN       (1U)
#define CAN_TRANSMIT_INT_EN_MSK       (((1U << CAN_TRANSMIT_INT_EN_LEN) - 1) << CAN_TRANSMIT_INT_EN_POS)
#define CAN_TRANSMIT_INT_EN_UMSK      (~(((1U << CAN_TRANSMIT_INT_EN_LEN) - 1) << CAN_TRANSMIT_INT_EN_POS))
#define CAN_ERROR_INT_EN              CAN_ERROR_INT_EN
#define CAN_ERROR_INT_EN_POS          (2U)
#define CAN_ERROR_INT_EN_LEN          (1U)
#define CAN_ERROR_INT_EN_MSK          (((1U << CAN_ERROR_INT_EN_LEN) - 1) << CAN_ERROR_INT_EN_POS)
#define CAN_ERROR_INT_EN_UMSK         (~(((1U << CAN_ERROR_INT_EN_LEN) - 1) << CAN_ERROR_INT_EN_POS))
#define CAN_DATA_OVERRUN_INT_EN       CAN_DATA_OVERRUN_INT_EN
#define CAN_DATA_OVERRUN_INT_EN_POS   (3U)
#define CAN_DATA_OVERRUN_INT_EN_LEN   (1U)
#define CAN_DATA_OVERRUN_INT_EN_MSK   (((1U << CAN_DATA_OVERRUN_INT_EN_LEN) - 1) << CAN_DATA_OVERRUN_INT_EN_POS)
#define CAN_DATA_OVERRUN_INT_EN_UMSK  (~(((1U << CAN_DATA_OVERRUN_INT_EN_LEN) - 1) << CAN_DATA_OVERRUN_INT_EN_POS))
#define CAN_ERROR_PASSIVE_INT_EN      CAN_ERROR_PASSIVE_INT_EN
#define CAN_ERROR_PASSIVE_INT_EN_POS  (5U)
#define CAN_ERROR_PASSIVE_INT_EN_LEN  (1U)
#define CAN_ERROR_PASSIVE_INT_EN_MSK  (((1U << CAN_ERROR_PASSIVE_INT_EN_LEN) - 1) << CAN_ERROR_PASSIVE_INT_EN_POS)
#define CAN_ERROR_PASSIVE_INT_EN_UMSK (~(((1U << CAN_ERROR_PASSIVE_INT_EN_LEN) - 1) << CAN_ERROR_PASSIVE_INT_EN_POS))
#define CAN_ARB_LOST_INT_EN           CAN_ARB_LOST_INT_EN
#define CAN_ARB_LOST_INT_EN_POS       (6U)
#define CAN_ARB_LOST_INT_EN_LEN       (1U)
#define CAN_ARB_LOST_INT_EN_MSK       (((1U << CAN_ARB_LOST_INT_EN_LEN) - 1) << CAN_ARB_LOST_INT_EN_POS)
#define CAN_ARB_LOST_INT_EN_UMSK      (~(((1U << CAN_ARB_LOST_INT_EN_LEN) - 1) << CAN_ARB_LOST_INT_EN_POS))
#define CAN_BUS_ERROR_INT_EN          CAN_BUS_ERROR_INT_EN
#define CAN_BUS_ERROR_INT_EN_POS      (7U)
#define CAN_BUS_ERROR_INT_EN_LEN      (1U)
#define CAN_BUS_ERROR_INT_EN_MSK      (((1U << CAN_BUS_ERROR_INT_EN_LEN) - 1) << CAN_BUS_ERROR_INT_EN_POS)
#define CAN_BUS_ERROR_INT_EN_UMSK     (~(((1U << CAN_BUS_ERROR_INT_EN_LEN) - 1) << CAN_BUS_ERROR_INT_EN_POS))

/* 0x18 : op mode:r   reset mode:rw */
#define CAN_BUS_TIMING_0_OFFSET      (0x18)
#define CAN_BAUD_RATE_PRESCALER      CAN_BAUD_RATE_PRESCALER
#define CAN_BAUD_RATE_PRESCALER_POS  (0U)
#define CAN_BAUD_RATE_PRESCALER_LEN  (6U)
#define CAN_BAUD_RATE_PRESCALER_MSK  (((1U << CAN_BAUD_RATE_PRESCALER_LEN) - 1) << CAN_BAUD_RATE_PRESCALER_POS)
#define CAN_BAUD_RATE_PRESCALER_UMSK (~(((1U << CAN_BAUD_RATE_PRESCALER_LEN) - 1) << CAN_BAUD_RATE_PRESCALER_POS))
#define CAN_SYNC_JUMP_WIDTH          CAN_SYNC_JUMP_WIDTH
#define CAN_SYNC_JUMP_WIDTH_POS      (6U)
#define CAN_SYNC_JUMP_WIDTH_LEN      (2U)
#define CAN_SYNC_JUMP_WIDTH_MSK      (((1U << CAN_SYNC_JUMP_WIDTH_LEN) - 1) << CAN_SYNC_JUMP_WIDTH_POS)
#define CAN_SYNC_JUMP_WIDTH_UMSK     (~(((1U << CAN_SYNC_JUMP_WIDTH_LEN) - 1) << CAN_SYNC_JUMP_WIDTH_POS))

/* 0x1c : op mode:r  reset mode:rw */
#define CAN_BUS_TIMING_1_OFFSET (0x1c)
#define CAN_TIME_SEGMENT_1      CAN_TIME_SEGMENT_1
#define CAN_TIME_SEGMENT_1_POS  (0U)
#define CAN_TIME_SEGMENT_1_LEN  (4U)
#define CAN_TIME_SEGMENT_1_MSK  (((1U << CAN_TIME_SEGMENT_1_LEN) - 1) << CAN_TIME_SEGMENT_1_POS)
#define CAN_TIME_SEGMENT_1_UMSK (~(((1U << CAN_TIME_SEGMENT_1_LEN) - 1) << CAN_TIME_SEGMENT_1_POS))
#define CAN_TIME_SEGMENT_2      CAN_TIME_SEGMENT_2
#define CAN_TIME_SEGMENT_2_POS  (4U)
#define CAN_TIME_SEGMENT_2_LEN  (3U)
#define CAN_TIME_SEGMENT_2_MSK  (((1U << CAN_TIME_SEGMENT_2_LEN) - 1) << CAN_TIME_SEGMENT_2_POS)
#define CAN_TIME_SEGMENT_2_UMSK (~(((1U << CAN_TIME_SEGMENT_2_LEN) - 1) << CAN_TIME_SEGMENT_2_POS))
#define CAN_SAMPLING            CAN_SAMPLING
#define CAN_SAMPLING_POS        (7U)
#define CAN_SAMPLING_LEN        (1U)
#define CAN_SAMPLING_MSK        (((1U << CAN_SAMPLING_LEN) - 1) << CAN_SAMPLING_POS)
#define CAN_SAMPLING_UMSK       (~(((1U << CAN_SAMPLING_LEN) - 1) << CAN_SAMPLING_POS))

/* 0x2c : op mode:r       reset mode:r */
#define CAN_ARB_LOST_CAPTURE_OFFSET (0x2c)
#define CAN_ALC4_0                  CAN_ALC4_0
#define CAN_ALC4_0_POS              (0U)
#define CAN_ALC4_0_LEN              (5U)
#define CAN_ALC4_0_MSK              (((1U << CAN_ALC4_0_LEN) - 1) << CAN_ALC4_0_POS)
#define CAN_ALC4_0_UMSK             (~(((1U << CAN_ALC4_0_LEN) - 1) << CAN_ALC4_0_POS))

