RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/can_reg.h
/* 0x30 : op mode:r      reset mode:r */
#define CAN_ERROR_CODE_CAPTURE_OFFSET (0x30)
#define CAN_SEGMENT4_0                CAN_SEGMENT4_0
#define CAN_SEGMENT4_0_POS            (0U)
#define CAN_SEGMENT4_0_LEN            (5U)
#define CAN_SEGMENT4_0_MSK            (((1U << CAN_SEGMENT4_0_LEN) - 1) << CAN_SEGMENT4_0_POS)
#define CAN_SEGMENT4_0_UMSK           (~(((1U << CAN_SEGMENT4_0_LEN) - 1) << CAN_SEGMENT4_0_POS))
#define CAN_DIR                       CAN_DIR
#define CAN_DIR_POS                   (5U)
#define CAN_DIR_LEN                   (1U)
#define CAN_DIR_MSK                   (((1U << CAN_DIR_LEN) - 1) << CAN_DIR_POS)
#define CAN_DIR_UMSK                  (~(((1U << CAN_DIR_LEN) - 1) << CAN_DIR_POS))
#define CAN_ERR_CODE                  CAN_ERR_CODE
#define CAN_ERR_CODE_POS              (6U)
#define CAN_ERR_CODE_LEN              (2U)
#define CAN_ERR_CODE_MSK              (((1U << CAN_ERR_CODE_LEN) - 1) << CAN_ERR_CODE_POS)
#define CAN_ERR_CODE_UMSK             (~(((1U << CAN_ERR_CODE_LEN) - 1) << CAN_ERR_CODE_POS))

/* 0x34 : op mode:r     reset mode:rw */
#define CAN_ERROR_WARNING_LIMIT_OFFSET (0x34)
#define CAN_ERR_WARNING_LIMIT          CAN_ERR_WARNING_LIMIT
#define CAN_ERR_WARNING_LIMIT_POS      (0U)
#define CAN_ERR_WARNING_LIMIT_LEN      (8U)
#define CAN_ERR_WARNING_LIMIT_MSK      (((1U << CAN_ERR_WARNING_LIMIT_LEN) - 1) << CAN_ERR_WARNING_LIMIT_POS)
#define CAN_ERR_WARNING_LIMIT_UMSK     (~(((1U << CAN_ERR_WARNING_LIMIT_LEN) - 1) << CAN_ERR_WARNING_LIMIT_POS))

/* 0x38 : op mode:r     reset mode:rw */
#define CAN_RX_ERR_COUNT_OFFSET (0x38)
#define CAN_RX_ERR_CNT          CAN_RX_ERR_CNT
#define CAN_RX_ERR_CNT_POS      (0U)
#define CAN_RX_ERR_CNT_LEN      (8U)
#define CAN_RX_ERR_CNT_MSK      (((1U << CAN_RX_ERR_CNT_LEN) - 1) << CAN_RX_ERR_CNT_POS)
#define CAN_RX_ERR_CNT_UMSK     (~(((1U << CAN_RX_ERR_CNT_LEN) - 1) << CAN_RX_ERR_CNT_POS))

/* 0x3c : op mode:r      reset mode:rw */
#define CAN_TX_ERR_COUNT_OFFSET (0x3c)
#define CAN_TX_ERR_CNT          CAN_TX_ERR_CNT
#define CAN_TX_ERR_CNT_POS      (0U)
#define CAN_TX_ERR_CNT_LEN      (8U)
#define CAN_TX_ERR_CNT_MSK      (((1U << CAN_TX_ERR_CNT_LEN) - 1) << CAN_TX_ERR_CNT_POS)
#define CAN_TX_ERR_CNT_UMSK     (~(((1U << CAN_TX_ERR_CNT_LEN) - 1) << CAN_TX_ERR_CNT_POS))

/* 0x40 : op mode: w  ->  tx_frm_info
                r   ->  rx_frm_info
reset mode:rw  -> acceptance_code0 */
#define CAN_TXRX_FRM_INFO_OR_ACCEPTANCE_CODE0_OFFSET (0x40)
#define CAN_TXRX_FRM_INFO_OR_ACCEPTANCE_CODE0        CAN_TXRX_FRM_INFO_OR_ACCEPTANCE_CODE0
#define CAN_TXRX_FRM_INFO_OR_ACCEPTANCE_CODE0_POS    (0U)
#define CAN_TXRX_FRM_INFO_OR_ACCEPTANCE_CODE0_LEN    (8U)
#define CAN_TXRX_FRM_INFO_OR_ACCEPTANCE_CODE0_MSK    (((1U << CAN_TXRX_FRM_INFO_OR_ACCEPTANCE_CODE0_LEN) - 1) << CAN_TXRX_FRM_INFO_OR_ACCEPTANCE_CODE0_POS)
#define CAN_TXRX_FRM_INFO_OR_ACCEPTANCE_CODE0_UMSK   (~(((1U << CAN_TXRX_FRM_INFO_OR_ACCEPTANCE_CODE0_LEN) - 1) << CAN_TXRX_FRM_INFO_OR_ACCEPTANCE_CODE0_POS))

/* 0x44 : op mode:w  ->  tx_id1
               r   ->  rx_id1
reset mode:rw  ->  acceptance_code1 */
#define CAN_TXRX_ID1_OR_ACCEPTANCE_CODE1_OFFSET (0x44)
#define CAN_TXRX_ID1_OR_ACCEPTANCE_CODE1        CAN_TXRX_ID1_OR_ACCEPTANCE_CODE1
#define CAN_TXRX_ID1_OR_ACCEPTANCE_CODE1_POS    (0U)
#define CAN_TXRX_ID1_OR_ACCEPTANCE_CODE1_LEN    (8U)
#define CAN_TXRX_ID1_OR_ACCEPTANCE_CODE1_MSK    (((1U << CAN_TXRX_ID1_OR_ACCEPTANCE_CODE1_LEN) - 1) << CAN_TXRX_ID1_OR_ACCEPTANCE_CODE1_POS)
#define CAN_TXRX_ID1_OR_ACCEPTANCE_CODE1_UMSK   (~(((1U << CAN_TXRX_ID1_OR_ACCEPTANCE_CODE1_LEN) - 1) << CAN_TXRX_ID1_OR_ACCEPTANCE_CODE1_POS))

/* 0x48 : op mode:w   ->  tx_id2
                r   ->  rx_id2
 reset mode:rw ->  acceptance_code2 */
#define CAN_TXRX_ID2_OR_ACCEPTANCE_CODE2_OFFSET (0x48)
#define CAN_TXRX_ID2_OR_ACCEPTANCE_CODE2        CAN_TXRX_ID2_OR_ACCEPTANCE_CODE2
#define CAN_TXRX_ID2_OR_ACCEPTANCE_CODE2_POS    (0U)
#define CAN_TXRX_ID2_OR_ACCEPTANCE_CODE2_LEN    (8U)
#define CAN_TXRX_ID2_OR_ACCEPTANCE_CODE2_MSK    (((1U << CAN_TXRX_ID2_OR_ACCEPTANCE_CODE2_LEN) - 1) << CAN_TXRX_ID2_OR_ACCEPTANCE_CODE2_POS)
#define CAN_TXRX_ID2_OR_ACCEPTANCE_CODE2_UMSK   (~(((1U << CAN_TXRX_ID2_OR_ACCEPTANCE_CODE2_LEN) - 1) << CAN_TXRX_ID2_OR_ACCEPTANCE_CODE2_POS))

/* 0x74 : op mode:r    reset mode:r */
#define CAN_RX_MESSAGE_COUNT_OFFSET (0x74)
#define CAN_RX_MESSAGE_CNT          CAN_RX_MESSAGE_CNT
#define CAN_RX_MESSAGE_CNT_POS      (0U)
#define CAN_RX_MESSAGE_CNT_LEN      (5U)
#define CAN_RX_MESSAGE_CNT_MSK      (((1U << CAN_RX_MESSAGE_CNT_LEN) - 1) << CAN_RX_MESSAGE_CNT_POS)
#define CAN_RX_MESSAGE_CNT_UMSK     (~(((1U << CAN_RX_MESSAGE_CNT_LEN) - 1) << CAN_RX_MESSAGE_CNT_POS))

/* 0x7c : op mode:rw       reset mode:rw    can_mode and cbp can be write in reset mode only */
#define CAN_CLOCK_DIVIDER_OFFSET (0x7c)
#define CAN_CD                   CAN_CD
#define CAN_CD_POS               (0U)
#define CAN_CD_LEN               (3U)
#define CAN_CD_MSK               (((1U << CAN_CD_LEN) - 1) << CAN_CD_POS)
#define CAN_CD_UMSK              (~(((1U << CAN_CD_LEN) - 1) << CAN_CD_POS))
#define CAN_CLOCKOFF             CAN_CLOCKOFF
#define CAN_CLOCKOFF_POS         (3U)
#define CAN_CLOCKOFF_LEN         (1U)
#define CAN_CLOCKOFF_MSK         (((1U << CAN_CLOCKOFF_LEN) - 1) << CAN_CLOCKOFF_POS)
#define CAN_CLOCKOFF_UMSK        (~(((1U << CAN_CLOCKOFF_LEN) - 1) << CAN_CLOCKOFF_POS))
#define CAN_READONLY             CAN_READONLY
#define CAN_READONLY_POS         (4U)
#define CAN_READONLY_LEN         (1U)
#define CAN_READONLY_MSK         (((1U << CAN_READONLY_LEN) - 1) << CAN_READONLY_POS)
#define CAN_READONLY_UMSK        (~(((1U << CAN_READONLY_LEN) - 1) << CAN_READONLY_POS))
#define CAN_RXINTEN              CAN_RXINTEN
#define CAN_RXINTEN_POS          (5U)
#define CAN_RXINTEN_LEN          (1U)
#define CAN_RXINTEN_MSK          (((1U << CAN_RXINTEN_LEN) - 1) << CAN_RXINTEN_POS)
#define CAN_RXINTEN_UMSK         (~(((1U << CAN_RXINTEN_LEN) - 1) << CAN_RXINTEN_POS))
#define CAN_CBP                  CAN_CBP
#define CAN_CBP_POS              (6U)
#define CAN_CBP_LEN              (1U)
#define CAN_CBP_MSK              (((1U << CAN_CBP_LEN) - 1) << CAN_CBP_POS)
#define CAN_CBP_UMSK             (~(((1U << CAN_CBP_LEN) - 1) << CAN_CBP_POS))
#define CAN_MODE                 CAN_MODE
#define CAN_MODE_POS             (7U)
#define CAN_MODE_LEN             (1U)
#define CAN_MODE_MSK             (((1U << CAN_MODE_LEN) - 1) << CAN_MODE_POS)
#define CAN_MODE_UMSK            (~(((1U << CAN_MODE_LEN) - 1) << CAN_MODE_POS))

/* 0x40 : Frame information */
#define CAN_INFORMATION_OFFSET (0x40)
#define CAN_INF_DLC            CAN_INF_DLC
#define CAN_INF_DLC_POS        (0U)
#define CAN_INF_DLC_LEN        (4U)
#define CAN_INF_DLC_MSK        (((1U << CAN_INF_DLC_LEN) - 1) << CAN_INF_DLC_POS)
#define CAN_INF_DLC_UMSK       (~(((1U << CAN_INF_DLC_LEN) - 1) << CAN_INF_DLC_POS))
#define CAN_INF_RTR            CAN_INF_RTR
#define CAN_INF_RTR_POS        (6U)
#define CAN_INF_RTR_LEN        (1U)
#define CAN_INF_RTR_MSK        (((1U << CAN_INF_RTR_LEN) - 1) << CAN_INF_RTR_POS)
#define CAN_INF_RTR_UMSK       (~(((1U << CAN_INF_RTR_LEN) - 1) << CAN_INF_RTR_POS))
#define CAN_INF_FF             CAN_INF_FF
#define CAN_INF_FF_POS         (7U)
#define CAN_INF_FF_LEN         (1U)
#define CAN_INF_FF_MSK         (((1U << CAN_INF_FF_LEN) - 1) << CAN_INF_FF_POS)
#define CAN_INF_FF_UMSK        (~(((1U << CAN_INF_FF_LEN) - 1) << CAN_INF_FF_POS))

/* 0x44 : Identifier 1, ID28~21 */
#define CAN_IDENTIFIER_1_OFFSET (0x44)

