RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/can_reg.h
    /* 0x70 : op mode:w  ->   tx_data8_e
               r   ->   rx_data8_e
reset mode:r   ->  8'H00 */
    union {
        struct {
            uint32_t txrx_data8_e  : 8;  /* [ 7: 0],        r/w,        0x0 */
            uint32_t reserved_8_31 : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } txrx_data8_e;

    /* 0x74 : op mode:r    reset mode:r */
    union {
        struct {
            uint32_t rx_message_cnt : 8;  /* [ 7: 0],        r/w,        0x0 */
            uint32_t reserved_8_31  : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rx_message_count;

    /* 0x78  reserved */
    uint8_t RESERVED0x78[4];

    /* 0x7c : op mode:rw       reset mode:rw    can_mode and cbp can be write in reset mode only */
    union {
        struct {
            uint32_t cd            : 3;  /* [ 2: 0],        r/w,        0x0 */
            uint32_t clockoff      : 1;  /* [    3],        r/w,        0x0 */
            uint32_t readonly      : 1;  /* [    4],          r,        0x0 */
            uint32_t rxinten       : 1;  /* [    5],        r/w,        0x0 */
            uint32_t cbp           : 1;  /* [    6],        r/w,        0x0 */
            uint32_t can_mode      : 1;  /* [    7],        r/w,        0x0 */
            uint32_t reserved_8_31 : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } clock_divider;
};

typedef volatile struct can_reg can_reg_t;

#endif /* __CAN_REG_H__ */
